package lesson12;

/*
* Создать исключения:
* MyArraySizeException (неправильный размер массива), и MyArrayDataException (в ячейке массива лежит что-то не то).
* Напишите метод, на вход которого подается двумерный строковый массив (String[][]) размером 4х4. При подаче массива
* другого размера необходимо бросить исключение MyArrayException.
* Далее метод должен пройтись по всем элементам массива, преобразовать в int и просуммировать. Если в каком-то элементе
* массива преобразование не удалось (например, в я чейке лежит символ или текст вместо числа), должно быть брошено
* исключение MyArrayDataException с детализацией, в какой именно ячейке лежат неверные данные. Расчет данных для
* этой матрицы прекращается.
* В метод main() нужно вызвать полученный метод, обработать возможные исключения MySizeArrayException и
* MyArrayDataException и вывести результат расчета.
*  */

public class ExceptionRunner {
    public static void main(String[] args) {

    }
}
